src/DataProcessors/CurrencyRatesNB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>CurrencyRatesNB</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>LoadPeriodBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>LoadPeriodEnding</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CurrencyList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CurrencyCode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RateDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ExchangeRate</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Multiplicity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/CurrencyRatesNB/Ext/ObjectModule.bsl
// Procedure fills tabular section with list of currencies. List contains only those
// currencies, whose rate does not depend on rate of other currencies.
//
Procedure FillCurrencyList() Export
	
	CurrencyList.Clear();
	
	LoadableCurrencies = WorkWithExchangeRates.GetLoadCurrenciesArray();
	
	For Each ItemCurrency In LoadableCurrencies Do
		NewRow = CurrencyList.Add();
		NewRow.CurrencyCode = ItemCurrency.Code;
		NewRow.Currency     = ItemCurrency;
	EndDo;
	
EndProcedure

// Procedure for every loaded currency requests file with rates
// After load, rates, matching period is written to information register
//
Function LoadCurrencyRates(Val ErrorMessage) Export
	
	Return WorkWithExchangeRatesClientServer.LoadCurrencyRatesByParameters(
	                  CurrencyList,
	                  LoadPeriodBegin,
	                  LoadPeriodEnding,
	                  ErrorMessage);
	
EndFunction
